---
kind: method
id: M:Autodesk.Revit.DB.Analysis.Polyloop.Dispose
source: html/18de56f9-5c4e-7e1b-7a9c-b246a2809e11.htm
---
# Autodesk.Revit.DB.Analysis.Polyloop.Dispose Method

Releases all resources used by the Polyloop

## Syntax (C#)
```csharp
public void Dispose()
```